{
  "about": "حول",
  "resume": "السيرة الذاتية",
  "projects": "المشاريع",
  "contact": "اتصل بي",
  "loading": "جارٍ التحميل...",
  "aboutme": "نبذة عني",
  "aboutdescription": "أنا مهندس برمجيات شغوف من أوزبكستان، أعيش حاليًا في بيشكيك، قرغيزستان. أتخصص في إنشاء تطبيقات ويب حديثة ومتجاوبة وسهلة الاستخدام باستخدام أحدث التقنيات مثل React.js وTailwind CSS وNext.js. منذ اللحظة التي اكتشفت فيها البرمجة، أدركت أنها أكثر من مجرد كود — إنها وسيلة لحل المشكلات الواقعية بطريقة إبداعية وفعّالة. أواصل التعلم واستكشاف أدوات وتقنيات جديدة لبناء تجارب رقمية تجمع بين الجمال والوظيفة. سواء كان تطوير تطبيقات ويب متكاملة، أو تصميم مواقع شخصية، أو مساعدة الشركات على النمو عبر الإنترنت — أتعامل مع كل مشروع بعناية وتركيز قوي على تجربة المستخدم.",
  "aboutdescription2": "بالإضافة إلى البرمجة، أنا مهتم بالتسويق وريادة الأعمال وبناء الأدوات التي تجعل الحياة أسهل. مهمتي بسيطة:",
  "aboutdescription3": "تحويل الأفكار الإبداعية إلى منتجات رقمية مؤثرة.",
  "imdoing": "ما الذي أفعله",
  "abdes1": "تطوير الويب",
  "abdes2": "بناء تطبيقات ويب حديثة باستخدام React وNext.js وتقنيات متقدمة أخرى.",
  "abdes3": "تطوير واجهات برمجة التطبيقات (API)",
  "abdes4": "إنشاء واجهات برمجة تطبيقات قوية وقابلة للتوسع باستخدام Node.js وExpress والتقنيات الخلفية الحديثة.",
  "abdes5": "تحسين محركات البحث (SEO)",
  "abdes6": "أقوم بتحسين المواقع لزيادة ظهورها في نتائج البحث من خلال تحسين البنية والمحتوى والسرعة وسهولة الوصول لمساعدتها في الحصول على ترتيب أعلى في Google.",
  "abdes7": "إدارة المدونات",
  "abdes8": "أكتب مقالات مفيدة وجذابة في مواضيع متنوعة مع الحفاظ على تفاعل مستمر مع جمهوري.",
  "viewresume": "السيرة الذاتية",
  "downloadresume": "تحميل السيرة الذاتية",
  "education": "التعليم",
  "educationplace": "جامعة قيرغيز الحكومية باسم إشنالي أراباييف",
  "educationdate": "2022 - حتى الآن، التخرج في عام 2026",
  "educationdescription": "أدرس درجة البكالوريوس في علوم الكمبيوتر بجامعة قيرغيز الحكومية باسم إشنالي أراباييف في بيشكيك. يغطي البرنامج هندسة البرمجيات وهياكل البيانات والخوارزميات وقواعد البيانات والشبكات والأمن السيبراني. يُركز على حل المشكلات العملية والتطبيق الواقعي للبرمجة والعمل الجماعي في المشاريع. أطور مهاراتي في JavaScript وPython وتصميم الأنظمة، وأتابع أحدث الاتجاهات في تقنيات الويب الحديثة.",
  "educationplace2": "أكاديمية سامي (دورة عبر الإنترنت)",
  "educationdate2": "2023 – حتى الآن",
  "educationdescription2": "أدرس في برنامج تطوير الويب الكامل (Full-Stack) في أكاديمية سامي، الذي يركز على تقنيات الويب الحديثة مثل HTML وCSS وJavaScript وReact وNext.js وNode.js وإدارة قواعد البيانات. يتضمن البرنامج مشاريع عملية وتطبيقات حقيقية وأفضل الممارسات في تطوير الويب. أعمل حاليًا على تحسين مهاراتي في إنشاء تطبيقات ويب متجاوبة وتطوير واجهات برمجة التطبيقات وإتقان التكامل بين الواجهة الأمامية والخلفية لتقديم تجربة مستخدم سلسة، بالإضافة إلى تطوير ذاتي مستمر.",
  "experience": "الخبرة",
  "freelance": "مطور ويب مستقل",
  "freelancedate": "2024 - حتى الآن",
  "internship": "طورت مواقع ويب متجاوبة للشركات الصغيرة ورواد الأعمال",
  "internship2": "أنشأت حلول تجارة إلكترونية مخصصة مع تكامل أنظمة الدفع",
  "internship3": "قمت بتحسين أداء المواقع وتحسين SEO لتحسين تجربة المستخدم",
  "internship4": "تعاونت مع المصممين لتنفيذ واجهات جذابة بصريًا",
  "webdegree": "مطور ويب مبتدئ (مشاريع شخصية)",
  "webdegreedate": "2022 – 2023",
  "webdegreetime": "سنة واحدة",
  "internship5": "ساعدت في تطوير وصيانة مواقع العملاء باستخدام React وNext.js",
  "internship6": "نفذت تصاميم متجاوبة وضمنت التوافق بين المتصفحات المختلفة",
  "internship7": "تعاونت مع الفريق ضمن عمليات تطوير مرنة (Agile)",
  "internship8": "اكتسبت خبرة في أنظمة التحكم في الإصدارات وخطوط النشر (deployment pipelines)",
  "skills": "المهارات",
  "programinglanguage": "لغات البرمجة",
  "frameworks": "الأُطر والمكتبات",
  "tools": "الأدوات والتقنيات",
  "databases": "قواعد البيانات",
  "projecttitle": "منصة InTeract",
  "projectdescription": "InTeract هي منصة دردشة في الوقت الحقيقي من الجيل الجديد، تم تطويرها بواسطة جسر أونغاروف باستخدام Next.js وMongoDB. صُممت للسرعة والموثوقية والتواصل السلس عبر الإنترنت.",
  "projecttitle2": "المعاملات (Al-Muamalat)",
  "projectdescription2": "منصة تركز على التمويل الإسلامي والتعليم والتعاون الدولي والامتثال للشريعة. التصميم البسيط ينظم الخدمات في أقسام واضحة، مما يسهل على المستخدمين التنقل والوصول إلى المحتوى الأساسي.",
  "projecttitle3": "المكتبة الافتراضية",
  "projectdescription3": "مكتبة رقمية تهدف إلى جعل الأدب في متناول الجميع. مجموعتنا المختارة تغطي مجموعة متنوعة من الأنواع والمواضيع لتقديم المعرفة بين يديك.",
  "projectstitle": "المشاريع",
  "viewproject": "عرض المشروع",
  "contactme": "اتصل بي",
  "contactmedescription": "لا تتردد في التواصل معي من خلال أي من هذه القنوات. أنا دائمًا منفتح على الفرص والتعاون الجديد.",
  "contactmeinfo": "معلومات الاتصال",
  "contactmeemail": "البريد الإلكتروني",
  "contactmephone": "رقم الهاتف",
  "contactmesocials": "وسائل التواصل الاجتماعي",
  "sendmessage": "إرسال رسالة",
  "name": "الاسم",
  "email": "البريد الإلكتروني",
  "message": "الرسالة",
  "yourname": "اسمك",
  "youremail": "بريدك الإلكتروني",
  "yourmessage": "رسالتك",
  "messagesend": "جاري إرسال الرسالة...",
  "messagesent": "تم إرسال الرسالة بنجاح!",
  "sendfail": "فشل في إرسال الرسالة. يرجى المحاولة مرة أخرى.",
  "sending": "جاري الإرسال...",
  "sendMessage": "إرسال الرسالة",
  "imhere": "أنا هنا",
  "opentowork": "مستعد للعمل",
  "Name": "جسر أونغاروف",
  "softwareengineer": "مهندس برمجيات",
  "location": "الموقع",
  "locationvalue": "بيشكيك، قرغيزستان"
}
