{
  "about": "About",
	"resume": "Resume",
	"projects": "Projects",
	"contact": "Contact",
	"loading": "Loading...",
	"aboutme": "About Me",
  "aboutdescription": "I'm a passionate software engineer originally from Uzbekistan, currently based in Bishkek, KG. I specialize in crafting modern, responsive, and user-friendly web applications using the latest technologies like React.js, Tailwind CSS, and NextJS. From the moment I discovered programming, I knew it was more than just code — it was a way to solve real-world problems creatively and efficiently. I'm constantly learning and exploring new tools and techniques to build digital experiences that are both functional and beautifully designed. Whether it's developing full-stack web apps, designing portfolios, or helping businesses grow online — I approach every project with attention to detail and a strong focus on user experience.",
	"aboutdescription2": "In addition to coding, I`m interested in marketing, entrepreneurship, and building tools that make life easier. My mission is simple: ",
	"aboutdescription3": "turn creative ideas into impactful digital products.",
	"imdoing": "What I`m Doing",
	"abdes1": "Web Development",
	"abdes2": "Building modern web applications with React, Next.js, and other cutting-edge technologies.",
	"abdes3": "API Development",
	"abdes4": "Creating robust and scalable APIs using Node.js, Express, and modern backend technologies.",
	"abdes5": "SEO Optimization",
	"abdes6": "I optimize websites for better search engine visibility by improving structure, content, speed, and accessibility to help them rank higher on Google.",
	"abdes7": "Blog Management",
	"abdes8": "I write useful and engaging blog posts on various topics, maintaining interactive communication with my audience.",
	"viewresume": "Resume",
	"downloadresume": "Download CV",
	"education": "Education",
	"educationplace": "Kyrgyz State University named after Ishenaly Arabaev",
	"educationdate": "2022 - Present, Complated in 2026",
	"educationdescription": "Pursuing a Bachelor`s degree in Computer Science at Kyrgyz State University named after Ishenaly Arabaev Bishkek. The course covers software engineering, data structures, algorithms, databases, networks, and cybersecurity. Emphasis is placed on practical problem solving, real-world application of code, and collaborative projects. Currently developing skills in JavaScript, Python, and system design while staying up-to-date with the latest trends in modern web technologies.",
	"educationplace2": "Sammi Academy (Online Course)",
	"educationdate2": "2023 – Present",
	"educationdescription2": "I studied in Sammi Academy's Full-Stack Web Development program, which focused on modern web technologies such as HTML, CSS, JavaScript, React, Next.js, Node.js, and database management. The curriculum included hands-on projects, real-world applications, and best practices in web development. Currently, I am working on improving my skills in creating responsive web applications, developing APIs, and mastering front-end and back-end integration to deliver seamless user experiences, while also continuing to work on myself.",
	"experience": "Experience",
	"freelance": "Freelance Web Developer",
	"freelancedate": "2024 - Present",
	"internship": "Developed responsive websites for small businesses and entrepreneurs",
	"internship2": "Created custom e-commerce solutions with payment integration",
	"internship3": "Optimized website performance and SEO for better user experience",
	"internship4": "Collaborated with designers to implement visually appealing interfaces",
	"webdegree": "Junior Web Developer (Personal Projects)",
	"webdegreedate": "2022 – 2023", 
	"webdegreetime": "1yr",
	"internship5": "Assisted in developing and maintaining client websites using React and Next.js",
	"internship6": "Implemented responsive designs and ensured cross-browser compatibility",
	"internship7": "Collaborated with the team on agile development processes",
	"internship8": "Gained experience with version control systems and deployment pipelines",
	"skills": "Skills",
	"programinglanguage": "Programming Languages",
	"frameworks": "Frameworks & Libraries",
	"tools": "Tools & Technologies",
	"databases": "Databases",
	"projecttitle": "InTeract Web Platform",
	"projectdescription": "InTeract is a next-generation real-time chat platform built with Next.js and MongoDB by Jasur Ungarov. Designed for speed, reliability, and seamless communication across the web.",
	"projecttitle2": "Al-Muamalat",
	"projectdescription2": "A platform focused on Islamic finance, education, international collaboration, and Shariah compliance. The clean design organizes services into clear sections, making it easy for users to navigate and access key offerings.",
	"projecttitle3": "Virtual Library",
	"projectdescription3": "A digital library dedicated to bringing literature to readers everywhere. Our curated collection covers multiple genres and topics, providing knowledge at your fingertips.",
	"projectstitle": "Projects",
	"viewproject": "View Project",
	"contactme": "Contact Me",
	"contactmedescription": "Feel free to reach out to me through any of these channels. I&apos;m always open to new opportunities and collaborations.",
	"contactmeinfo": "Contact InfoContact Information",
	"contactmeemail": "Email",
	"contactmephone": "Phone",
	"contactmesocials": "Social Media",
	"sendmessage": "Send Message",
	"name": "Name",
	"email": "Email",
	"message": "Message",
	"yourname": "Your Name",
	"youremail": "Your Email",
	"yourmessage": "Your Message",
	"messagesend": "Sending message...",
	"messagesent": "Message sent successfully!",
	"sendfail": "Failed to send message. Please try again.",
	"sending": "Sending...",
	"sendMessage": "Send Message",
	"imhere": "I'm here",
	"opentowork": "Open to Work",
	"Name": "Jasur Ungarov",
	"softwareengineer": "Software Engineer",
	"location": "Location",
	"locationvalue": "Bishkek, Kyrgyzstan"
}