{
"about": "О,нас",
"resume": "Резюме",
"projects": "Проекты",
"contact": "Контакты",
"loading": "Загрузка...",
"aboutme": "Обо мне",
  "aboutdescription": "Я — увлечённый инженер-программист, родом из Узбекистана, в настоящее время проживаю в Бишкеке, Кыргызстан. Специализируюсь на создании современных, адаптивных и удобных веб-приложений с использованием таких технологий, как React.js, Tailwind CSS и Next.js. С момента, как я открыл для себя программирование, понял, что это не просто код — это способ творчески и эффективно решать реальные задачи. Я постоянно изучаю новые инструменты и техники, чтобы создавать цифровые продукты, которые сочетают функциональность и красивый дизайн. Разрабатываю как полноценные веб-приложения, так и портфолио-сайты, помогая бизнесу расти в онлайне, уделяя особое внимание деталям и пользовательскому опыту.",
  "aboutdescription2": "Помимо программирования, я интересуюсь маркетингом, предпринимательством и созданием инструментов, которые упрощают жизнь. Моя миссия проста:",
  "aboutdescription3": "превращать креативные идеи в значимые цифровые продукты.",
  "imdoing": "Чем я занимаюсь",
  "abdes1": "Веб-разработка",
  "abdes2": "Создание современных веб-приложений с использованием React, Next.js и других передовых технологий.",
  "abdes3": "Разработка API",
  "abdes4": "Создание надёжных и масштабируемых API с использованием Node.js, Express и современных серверных технологий.",
  "abdes5": "SEO-оптимизация",
  "abdes6": "Оптимизирую сайты для улучшения видимости в поисковых системах, улучшая структуру, контент, скорость и доступность, чтобы помочь им занимать более высокие позиции в Google.",
  "abdes7": "Управление блогом",
  "abdes8": "Пишу полезные и увлекательные статьи на разные темы, поддерживая интерактивное общение с аудиторией.",
  "viewresume": "Резюме",
  "downloadresume": "Скачать CV",
  "education": "Образование",
  "educationplace": "Кыргызский государственный университет имени Ишеналы Арабаева",
  "educationdate": "2022 - настоящее время, окончание в 2026 году",
  "educationdescription": "Получаю степень бакалавра по специальности 'Информатика' в Кыргызском государственном университете имени Ишеналы Арабаева, г. Бишкек. Обучение охватывает программную инженерию, структуры данных, алгоритмы, базы данных, сети и кибербезопасность. Основное внимание уделяется решению практических задач, реальному применению кода и командным проектам. В настоящее время развиваю навыки работы с JavaScript, Python и проектированием систем, следя за последними тенденциями в веб-технологиях.",
  "educationplace2": "Онлайн-школа Sammi Academy",
  "educationdate2": "2023 – настоящее время",
  "educationdescription2": "Прохожу курс Full-Stack Web Development в Sammi Academy, где изучаются современные веб-технологии: HTML, CSS, JavaScript, React, Next.js, Node.js и управление базами данных. Программа включает практические проекты, реальные кейсы и лучшие подходы в веб-разработке. В настоящее время совершенствую навыки создания адаптивных веб-приложений, разработки API и интеграции фронтенда и бэкенда для обеспечения плавного пользовательского опыта, а также продолжаю работать над саморазвитием.",
  "experience": "Опыт работы",
  "freelance": "Фриланс веб-разработчик",
  "freelancedate": "2024 - настоящее время",
  "internship": "Разрабатывал адаптивные сайты для малого бизнеса и предпринимателей",
  "internship2": "Создавал индивидуальные решения для интернет-магазинов с интеграцией платёжных систем",
  "internship3": "Оптимизировал производительность сайтов и SEO для улучшения пользовательского опыта",
  "internship4": "Сотрудничал с дизайнерами для реализации визуально привлекательных интерфейсов",
  "webdegree": "Младший веб-разработчик (личные проекты)",
  "webdegreedate": "2022 – 2023",
  "webdegreetime": "1 год",
  "internship5": "Помогал в разработке и поддержке сайтов клиентов с использованием React и Next.js",
  "internship6": "Реализовал адаптивный дизайн и обеспечил совместимость между браузерами",
  "internship7": "Работал в команде, используя гибкие (agile) методологии разработки",
  "internship8": "Получил опыт работы с системами контроля версий и процессами деплоя",
  "skills": "Навыки",
  "programinglanguage": "Языки программирования",
  "frameworks": "Фреймворки и библиотеки",
  "tools": "Инструменты и технологии",
  "databases": "Базы данных",
  "projecttitle": "InTeract Web Platform",
  "projectdescription": "InTeract — это современная платформа для общения в реальном времени, созданная Джасуром Унгаровым с использованием Next.js и MongoDB. Разработана для скорости, надёжности и бесшовной коммуникации в интернете.",
  "projecttitle2": "Al-Muamalat",
  "projectdescription2": "Платформа, ориентированная на исламские финансы, образование, международное сотрудничество и соответствие нормам шариата. Чистый дизайн разделяет сервисы по категориям, обеспечивая удобную навигацию и быстрый доступ к основным функциям.",
  "projecttitle3": "Виртуальная библиотека",
  "projectdescription3": "Цифровая библиотека, созданная для того, чтобы сделать литературу доступной каждому. Подборка включает разные жанры и темы, предоставляя знания прямо под рукой.",
  "projectstitle": "Проекты",
  "viewproject": "Посмотреть проект",
  "contactme": "Связаться со мной",
  "contactmedescription": "Свяжитесь со мной любым удобным способом. Я всегда открыт для новых возможностей и сотрудничества.",
  "contactmeinfo": "Контактная информация",
  "contactmeemail": "Электронная почта",
  "contactmephone": "Телефон",
  "contactmesocials": "Социальные сети",
  "sendmessage": "Отправить сообщение",
  "name": "Имя",
  "email": "Электронная почта",
  "message": "Сообщение",
  "yourname": "Ваше имя",
  "youremail": "Ваш email",
  "yourmessage": "Ваше сообщение",
  "messagesend": "Отправка сообщения...",
  "messagesent": "Сообщение успешно отправлено!",
  "sendfail": "Не удалось отправить сообщение. Пожалуйста, попробуйте снова.",
  "sending": "Отправка...",
  "sendMessage": "Отправить сообщение",
  "imhere": "Я здесь",
  "opentowork": "Открыт для работы",
  "Name": "Джасур Унгаров",
  "softwareengineer": "Инженер-программист",
  "location": "Местоположение",
  "locationvalue": "Бишкек, Кыргызстан"
}