{
  "about": "Haqida",
	"resume": "Rezyume",
	"projects": "Loyihalar",
	"contact": "Aloqa",
	"loading": "Yuklanmoqda...",
	"aboutme": "Men haqimda",
	"aboutdescription": "Men asl kelib chiqishim o'zbekistonlik, hozirda esa Bishkekda, Qirg‘izistonda faoliyat yuritayotgan ishtiyoqli dasturiy ta’minot muhandisiman. Zamonaviy, moslashuvchan va foydalanuvchiga qulay veb-ilovalarni React.js, Tailwind CSS va NextJS kabi so‘nggi texnologiyalar yordamida yaratishga ixtisoslashganman. Dasturlashni birinchi bor kashf etganimda, bu shunchaki kod emasligini, balki real hayotdagi muammolarni ijodkorona va samarali tarzda hal qilish usuli ekanligini angladim. Men doimo yangi vositalar va texnikalarni o‘rganishga, ularni qo‘llab funksional va estetik jihatdan chiroyli raqamli tajribalar yaratishga intilaman. To‘liq funksional veb-ilovalar ishlab chiqish, portfoliolar dizayni yoki bizneslarni onlayn rivojlantirish bo‘ladimi — har bir loyihaga e’tibor bilan, foydalanuvchi tajribasiga chuqur e’tibor qaratgan holda yondashaman.",
	"aboutdescription2": "Dasturlashdan tashqari, men marketing, tadbirkorlik va hayotni osonlashtiradigan vositalar yaratishga ham qiziqaman. Mening maqsadim oddiy: ",
	"aboutdescription3": "ijodiy g'oyalarni ta'sirli raqamli mahsulotlarga aylantiraman.",
	"imdoing": "Men nimalar bilan shug‘ullanaman",
	"abdes1": "Web-dasturlash",
	"abdes2": "React, Next.js va boshqa ilg'or texnologiyalar yordamida zamonaviy veb-ilovalarni yarataman.",
	"abdes3": "API ishlab chiqish",
	"abdes4": "Node.js, Express va zamonaviy backend texnologiyalardan foydalangan holda mustahkam va kengaytiriladigan APIlar yaratish.",
	"abdes5": "SEO optimizatsiyasi",
	"abdes6": "Men sayt tuzilmasi, kontenti, tezligi va foydalanish qulayligini yaxshilash orqali ularning Google'da yuqori o'rinlarga chiqishini ta'minlayman.",
	"abdes7": "Blog boshqaruvi",
	"abdes8": "Men turli mavzularda foydali va qiziqarli blog postlarini yozaman, auditoriyam bilan interaktiv muloqotni saqlayman.",
	"viewresume": "Rezyume",
	"downloadresume": "CV yuklab olish",
	"education": "Ta'lim",
	"educationplace": "Ishenali Arabayev nomidagi Qirgʻiziston davlat universiteti",
	"educationdate": "2022 - yildan beri, 2026 yilda tugallanadi",
	"educationdescription": "Ishenali Arabayev nomidagi Qirgʻiziston Davlat universitetida kompyuter fanlari boʻyicha bakalavr darajasini olish. Kurs dasturiy ta'minot muhandisligi, ma'lumotlar tuzilmalari, algoritmlar, ma'lumotlar bazalari, tarmoqlar va kiberxavfsizlikni o'z ichiga oladi. Asosiy e'tibor muammolarni amaliy hal qilish, kodni real hayotda qo'llash va hamkorlikdagi loyihalarga qaratiladi. Hozirgi vaqtda zamonaviy veb-texnologiyalardagi so'nggi tendentsiyalardan xabardor bo'lgan holda JavaScript, Python va tizim dizayni bo'yicha ko'nikmalarni rivojlantirmoqda.",
	"educationplace2": "Sammi akademiyasi (onlayn kurs)",
	"educationdate2": "2023 – yildan beri",
	"educationdescription2": "Men Sammi Akademiyasining HTML, CSS, JavaScript, React, Next.js, Node.js va maʼlumotlar bazasini boshqarish kabi zamonaviy veb-texnologiyalarga yoʻnaltirilgan Full-Stack Web Development dasturida tahsil oldim. O‘quv dasturiga amaliy loyihalar, real ilovalar va veb-ishlab chiqish bo‘yicha ilg‘or tajribalar kiritilgan. Hozirda men sezgir veb-ilovalarni yaratish, API-larni ishlab chiqish va foydalanuvchilarning uzluksiz tajribasini taqdim etish uchun front-end va back-end integratsiyasini o'zlashtirish bo'yicha ko'nikmalarimni oshirish ustida ishlayapman, shu bilan birga o'z ustimda ishlashda davom etmoqdaman.",
	"experience": "Tajriba",
	"freelance": "Frilanser Veb Dasturchi",
	"freelancedate": "2024 - Hozirgacha",
	"internship": "Kichik biznes va tadbirkorlar uchun moslashuvchan (responsive) veb-saytlar ishlab chiqilgan",
	"internship2": "To‘lov tizimi integratsiyasi bilan maxsus e-commerce (onlayn do‘kon) yechimlari yaratilgan",
	"internship3": "Foydalanuvchi tajribasini yaxshilash uchun sayt ishlash samaradorligi va SEO optimallashtirilgan",
	"internship4": "Dizaynerlar bilan hamkorlikda jozibali interfeyslar ishlab chiqilgan",
	"webdegree": "Junior Veb Dasturchi (Shaxsiy loyihalar)",
	"webdegreedate": "2022 – 2023",
	"webdegreetime": "1 yil",
	"internship5": "React va Next.js yordamida mijozlar saytlarini ishlab chiqish va qo‘llab-quvvatlashda yordam berilgan",
	"internship6": "Responsiv dizaynlar joriy etilib, barcha brauzerlarda moslik ta’minlangan",
	"internship7": "Agile jarayonlariga asoslangan jamoaviy ishlarda ishtirok etilgan",
	"internship8": "Versiya boshqaruvi tizimlari va deploy (joylashtirish) jarayonlarida tajriba orttirilgan",
	"skills": "Ko‘nikmalar",
	"programinglanguage": "Dasturlash tillari",
	"frameworks": "Freymvorklar va kutubxonalar",
	"tools": "Asboblar va texnologiyalar",
	"databases": "Ma’lumotlar bazalari",
	"projecttitle": "InTeract Veb Platformasi",
	"projectdescription": "InTeract — bu Jasur Ungarov tomonidan Next.js va MongoDB texnologiyalarida yaratilgan yangi avlod real vaqtli chat platformasi. U tezlik, ishonchlilik va vebda uzluksiz muloqot uchun mo‘ljallangan.",
	"projecttitle2": "Al-Muamalat",
	"projectdescription2": "Islomiy moliya, ta’lim, xalqaro hamkorlik va shariatga muvofiqlikka qaratilgan platforma. Toza va tartibli dizayn xizmatlarni aniq bo‘limlarga ajratib, foydalanuvchilar uchun navigatsiyani qulay qiladi.",
	"projecttitle3": "Virtual Kutubxona",
	"projectdescription3": "Dunyoning istalgan nuqtasidagi o‘quvchilarga adabiyotlarni yetkazishga bag‘ishlangan raqamli kutubxona. Tanlab olingan to‘plam turli janr va mavzularni o‘z ichiga olib, bilimni qo‘lingiz ostida taqdim etadi.",
	"projectstitle": "Loyihalar",
	"viewproject": "Loyihani ko‘rish",
	"contactme": "Men bilan bog‘lanish",
	"contactmedescription": "Quyidagi aloqa kanallari orqali bemalol bog‘lanishingiz mumkin. Men har doim yangi imkoniyatlar va hamkorliklarga tayyorman.",
	"contactmeinfo": "Aloqa Ma’lumotlari",
	"contactmeemail": "Elektron pochta",
	"contactmephone": "Telefon",
	"contactmesocials": "Ijtimoiy tarmoqlar",
	"sendmessage": "Xabar yuborish",
	"name": "Ism",
	"email": "Elektron pochta",
	"message": "Xabar",
	"yourname": "Ismingiz",
	"youremail": "Elektron pochtangiz",
	"yourmessage": "Xabaringiz",
	"messagesend": "Xabar yuborilmoqda...",
	"messagesent": "Xabar muvaffaqiyatli yuborildi!",
	"sendfail": "Xabarni yuborib bo‘lmadi. Iltimos, qayta urinib ko‘ring.",
	"sending": "Yuborilmoqda...",
	"sendMessage": "Xabar yuborish",

	"imhere": "Men bu yerdaman",
	"opentowork": "Ishlashga tayyor",
	"Name": "Jasur Ungarov",
	"softwareengineer": "Dasturiy ta’minot muhandisi",
	"location": "Joylashuv",
	"locationvalue": "Bishkek, Qirg‘iziston"
}